Repository: salmonloop/salmon-egg
Catalog: SalmonEgg/SalmonEgg/Strings/*/Resources.resw
Source language: en_us
Languages: zh_hans

# SettingsNav_General.Content
source: General
zh_hans: 常规

# SettingsNav_Appearance.Content
source: Appearance
zh_hans: 外观

# SettingsNav_DataStorage.Content
source: Data & Storage
zh_hans: 数据与存储

# SettingsNav_Shortcuts.Content
source: Shortcuts
zh_hans: 快捷键

# SettingsNav_Diagnostics.Content
source: Diagnostics & Logs
zh_hans: 诊断与日志

# SettingsNav_About.Content
source: About
zh_hans: 关于

# Appearance_ThemeTitle.Text
source: Theme
zh_hans: 界面主题

# Appearance_ThemeDescription.Text
source: Choose your preferred app theme.
zh_hans: 选择您偏好的应用主题颜色

# Appearance_ThemeSystem.Content
source: System
zh_hans: 跟随系统

# Appearance_ThemeLight.Content
source: Light
zh_hans: 浅色

# Appearance_ThemeDark.Content
source: Dark
zh_hans: 深色

# Appearance_MotionTitle.Text
source: Interaction
zh_hans: 交互体验

# Appearance_MotionToggleTitle.Text
source: Page transitions
zh_hans: 全局过渡动画

# Appearance_MotionToggleDescription.Text
source: When enabled, page transitions use smooth animations.
zh_hans: 开启后，页面切换将使用平滑过渡效果

# Appearance_MotionToggle.OnContent
source: On
zh_hans: 已开启

# Appearance_MotionToggle.OffContent
source: Off
zh_hans: 已禁用

# Appearance_BackdropTitle.Text
source: Backdrop
zh_hans: 背景材质

# Appearance_BackdropDescription.Text
source: Choose window backdrop (may fall back on older systems).
zh_hans: 选择窗口背景效果（不同系统版本会自动降级）

# Appearance_BackdropSystem.Content
source: Automatic (recommended)
zh_hans: 自动（系统推荐）

# Appearance_BackdropSolid.Content
source: Solid
zh_hans: 纯色

# Appearance_Notice.Title
source: Note
zh_hans: 提示

# Appearance_Notice.Message
source: Theme, animation, and backdrop take effect immediately (some platforms may require restart).
zh_hans: 主题、动画和材质设置会立即生效（部分平台可能需要重启）。

# General_StartupTitle.Text
source: Startup and window
zh_hans: 启动与窗口

# General_AutoStart.Header
source: Launch on startup
zh_hans: 开机自动启动

# General_AutoStart.OnContent
source: On
zh_hans: 开启

# General_AutoStart.OffContent
source: Off
zh_hans: 关闭

# General_AutoStartUnsupported.Text
source: Not supported on this platform.
zh_hans: 当前平台不支持开机自动启动

# General_MinimizeToTray.Header
source: Minimize to tray
zh_hans: 最小化到系统托盘

# General_MinimizeToTray.OnContent
source: On
zh_hans: 开启

# General_MinimizeToTray.OffContent
source: Off
zh_hans: 关闭

# General_TrayUnsupported.Text
source: System tray is not available on this platform.
zh_hans: 当前平台暂未集成系统托盘支持

# General_LanguageTitle.Text
source: Language and region
zh_hans: 语言与地区

# General_LanguageLabel.Text
source: UI language
zh_hans: 选择界面语言

# General_LanguageSystem.Content
source: System
zh_hans: 跟随系统

# General_LanguageZhCn.Content
source: Simplified Chinese
zh_hans: 简体中文

# General_LanguageUnsupported.Text
source: Language override is not supported on this platform.
zh_hans: 当前平台不支持语言覆盖

# General_LanguageRestartHint.Text
source: Some settings take effect after restarting the app.
zh_hans: 部分设置在重新启动应用后生效

# General_MaintenanceTitle.Text
source: Maintenance
zh_hans: 维护

# General_ClearCacheTitle.Text
source: Clear local cache
zh_hans: 清理本地缓存

# General_ClearCacheDescription.Text
source: Deletes all files in the local cache folder.
zh_hans: 将删除本地缓存目录下的所有文件

# General_ClearCacheAction.Content
source: Clear
zh_hans: 清理

# DataStorage_PrivacyTitle.Text
source: Privacy
zh_hans: 隐私

# DataStorage_SaveLocalHistory.Header
source: Save local history
zh_hans: 保存本地历史

# DataStorage_SaveLocalHistory.OnContent
source: On
zh_hans: 开启

# DataStorage_SaveLocalHistory.OffContent
source: Off
zh_hans: 关闭

# DataStorage_HistoryRetentionLabel.Text
source: History retention (days)
zh_hans: 历史保留天数

# DataStorage_RememberRecentProjects.Header
source: Remember recent project paths
zh_hans: 记住最近项目路径

# DataStorage_RememberRecentProjects.OnContent
source: On
zh_hans: 开启

# DataStorage_RememberRecentProjects.OffContent
source: Off
zh_hans: 关闭

# DataStorage_CacheTitle.Text
source: Cache
zh_hans: 缓存

# DataStorage_CacheRetentionLabel.Text
source: Cache retention (days)
zh_hans: 缓存保留天数

# DataStorage_ClearCache.Content
source: Clear cache
zh_hans: 清理缓存

# DataStorage_OpenCacheFolder.Content
source: Open cache folder
zh_hans: 打开缓存目录

# DataStorage_ExportTitle.Text
source: Export
zh_hans: 导出

# DataStorage_ExportDescription.Text
source: Export sessions (current session/messages) and diagnostics to the exports folder.
zh_hans: 导出会话（当前会话/当前消息列表）与诊断包到 exports 目录

# DataStorage_ExportMarkdown.Content
source: Export session (Markdown)
zh_hans: 导出会话（Markdown）

# DataStorage_ExportJson.Content
source: Export session (JSON)
zh_hans: 导出会话（JSON）

# DataStorage_ExportDiagnostics.Content
source: Export diagnostics (ZIP)
zh_hans: 导出诊断包（ZIP）

# DataStorage_OpenExports.Content
source: Open exports folder
zh_hans: 打开导出目录

# DataStorage_ResetTitle.Text
source: Reset
zh_hans: 重置

# DataStorage_ResetDefaults.Content
source: Restore defaults
zh_hans: 恢复默认设置

# DataStorage_ClearAllData.Content
source: Clear all local data
zh_hans: 清空所有本地数据

# DataStorage_ResetWarning.Text
source: Clearing local data removes configs, logs, caches, etc. This cannot be undone.
zh_hans: 清空本地数据会删除配置、日志、缓存等文件。此操作不可撤销。

# Diagnostics_EnvironmentTitle.Text
source: Environment
zh_hans: 运行环境

# Diagnostics_AppVersionLabel.Text
source: App version:
zh_hans: 应用版本：

# Diagnostics_ProtocolVersionLabel.Text
source: Protocol version:
zh_hans: 协议版本：

# Diagnostics_LogsTitle.Text
source: Logs
zh_hans: 日志

# Diagnostics_LogsFolderLabel.Text
source: Logs folder:
zh_hans: 日志目录：

# Diagnostics_LatestLogLabel.Text
source: Latest log file:
zh_hans: 最新日志文件：

# Diagnostics_OpenLogs.Content
source: Open logs folder
zh_hans: 打开日志目录

# Diagnostics_CopyLogSnippet.Content
source: Copy recent log snippet
zh_hans: 复制最近日志片段

# Diagnostics_RefreshLogs.Content
source: Refresh
zh_hans: 刷新

# Diagnostics_OpenLiveLog.Content
source: View live logs
zh_hans: 查看实时日志

# Diagnostics_LiveLogHeader.Text
source: Live logs
zh_hans: 实时日志

# Diagnostics_LiveLogStart.Content
source: Start
zh_hans: 启动

# Diagnostics_LiveLogPause.Content
source: Pause
zh_hans: 暂停

# Diagnostics_LiveLogResume.Content
source: Resume
zh_hans: 继续

# Diagnostics_LiveLogClear.Content
source: Clear view
zh_hans: 清空视图

# Diagnostics_LiveLogCollapse.Content
source: Collapse
zh_hans: 收起

# Diagnostics_LiveLogHint.Text
source: Live streaming stops automatically when you leave this page.
zh_hans: 离开页面后会自动停止实时打印。

# Diagnostics_ConnectionTitle.Text
source: Connection diagnostics
zh_hans: 连接诊断

# Diagnostics_ConnectionStatusLabel.Text
source: Status:
zh_hans: 当前状态：

# Diagnostics_SessionLabel.Text
source: Session:
zh_hans: 会话：

# Diagnostics_BundleTitle.Text
source: Diagnostics bundle
zh_hans: 诊断包

# Diagnostics_BundleDescription.Text
source: Generate a ZIP with configuration (no secrets), logs, and environment snapshot.
zh_hans: 生成 ZIP 包，包含配置（不含密钥）、日志与环境快照。

# Diagnostics_CreateBundle.Content
source: Generate diagnostics (ZIP)
zh_hans: 生成诊断包（ZIP）

# Shortcuts_ConflictInfo.Title
source: Shortcut conflicts
zh_hans: 快捷键冲突

# Shortcuts_InvalidInfo.Title
source: Invalid shortcut format
zh_hans: 快捷键格式无效

# Shortcuts_InvalidInfo.Message
source: Enter formats like Ctrl+K or Ctrl+Shift+N.
zh_hans: 请输入如 Ctrl+K、Ctrl+Shift+N 的格式。

# Shortcuts_CustomTitle.Text
source: Customize
zh_hans: 自定义

# Shortcuts_GestureInput.PlaceholderText
source: e.g. Ctrl+K
zh_hans: 例如：Ctrl+K

# Shortcuts_RestoreSingle.Content
source: Restore
zh_hans: 恢复

# Shortcuts_RestoreAll.Content
source: Restore all defaults
zh_hans: 全部恢复默认

# About_AppInfoTitle.Text
source: App info
zh_hans: 应用信息

# About_VersionLabel.Text
source: Version:
zh_hans: 版本：

# About_ProtocolLabel.Text
source: Protocol version:
zh_hans: 协议版本：

# About_SupportTitle.Text
source: Support
zh_hans: 支持

# About_OpenAppData.Content
source: Open app data folder
zh_hans: 打开应用数据目录

# About_OpenReleaseNotes.Content
source: Open release notes
zh_hans: 打开更新日志

# About_OpenPrivacyPolicy.Content
source: Open privacy policy
zh_hans: 打开隐私政策

# About_CopyVersionInfo.Content
source: Copy version info
zh_hans: 复制版本信息

# About_DocsFolderLabel.Text
source: Docs folder:
zh_hans: 文档目录：

# About_DocsHint.Text
source: Place release-notes.md and privacy-policy.md here to open them.
zh_hans: 将 release-notes.md 与 privacy-policy.md 放入该目录后即可一键打开。

# Conn_Title.Text
source: Connection and services
zh_hans: 连接与服务配置

# Conn_ActiveSessionTitle.Text
source: Active session connection
zh_hans: 活动会话连接

# Conn_TransportLabel.Text
source: Transport
zh_hans: 传输协议

# Conn_TransportStdio.Content
source: Stdio (local)
zh_hans: Stdio (子进程)

# Conn_StdioCommand.Header
source: Command
zh_hans: 执行命令

# Conn_StdioCommand.PlaceholderText
source: e.g. python, node
zh_hans: 例如: python, node

# Conn_StdioArgs.Header
source: Arguments
zh_hans: 参数

# Conn_StdioArgs.PlaceholderText
source: e.g. server.py
zh_hans: 例如: server.py

# Conn_RemoteUrl.Header
source: Server URL
zh_hans: 服务器地址

# Conn_ConnectButton.Content
source: Connect
zh_hans: 连接到服务器

# Conn_ErrorInfo.Title
source: Connection failed
zh_hans: 连接失败

# Conn_SuccessInfo.Title
source: Connected
zh_hans: 连接成功

# Conn_SuccessInfo.Message
source: Session established. You can start chatting.
zh_hans: 已建立会话，可以开始对话。

# Conn_GoToChat.Content
source: Enter chat
zh_hans: 进入对话

# Conn_PresetsTitle.Text
source: Server presets
zh_hans: 预设服务器

# Conn_PresetsAdd.Text
source: New
zh_hans: 新建

# Conn_PresetEdit.ToolTipService.ToolTip
source: Edit
zh_hans: 编辑

# Conn_PresetDelete.ToolTipService.ToolTip
source: Delete
zh_hans: 删除

# Acp_OverviewTitle.Text
source: Current connection
zh_hans: 当前连接状态

# Acp_ConnectionToggle.Header
source: Connection
zh_hans: 连接

# Acp_ConnectionToggle.OnContent
source: On
zh_hans: 开

# Acp_ConnectionToggle.OffContent
source: Off
zh_hans: 关

# Acp_TransportLabel.Text
source: Transport
zh_hans: 传输协议

# Acp_EndpointLabel.Text
source: Endpoint
zh_hans: 端点

# Acp_ProfilesTitle.Text
source: My agents
zh_hans: 我的 Agent

# Acp_ProfilesRefresh.Content
source: Refresh
zh_hans: 刷新

# Acp_ProfilesAdd.Content
source: New
zh_hans: 新建

# Acp_ProfileMore.ToolTipService.ToolTip
source: More
zh_hans: 更多

# Acp_ProfileConnect.Text
source: Connect
zh_hans: 连接

# Acp_ProfileEdit.Text
source: Edit
zh_hans: 编辑

# Acp_ProfileDelete.Text
source: Delete
zh_hans: 删除

# Acp_DiagnosticsTitle.Text
source: Diagnostics
zh_hans: 诊断

# Acp_DiagnosticsSubtitle.Text
source: Connection details
zh_hans: 连接相关信息

# Acp_DiagnosticsVersionLabel.Text
source: Version
zh_hans: 版本

# Start_Title.AutomationProperties.Name
source: Salmon Egg welcome title
zh_hans: Salmon Egg 欢迎标题

# Start_Quick1.AutomationProperties.Name
source: Quick entry 1
zh_hans: 智能推荐入口 1

# Start_Quick2.AutomationProperties.Name
source: Quick entry 2
zh_hans: 智能推荐入口 2

# Start_Quick3.AutomationProperties.Name
source: Quick entry 3
zh_hans: 智能推荐入口 3

# Start_Quick1Title.Text
source: Quick pick 1
zh_hans: 智能推荐 1

# Start_Quick1Subtitle.Text
source: Placeholder
zh_hans: 占位符

# Start_Quick2Title.Text
source: Quick pick 2
zh_hans: 智能推荐 2

# Start_Quick2Subtitle.Text
source: Placeholder
zh_hans: 占位符

# Start_Quick3Title.Text
source: Quick pick 3
zh_hans: 智能推荐 3

# Start_Quick3Subtitle.Text
source: Placeholder
zh_hans: 占位符

# TopSearchBox.PlaceholderText
source: Search
zh_hans: 搜索

# TopSearchBox.AutomationProperties.Name
source: Search
zh_hans: 搜索

# SearchPanelRecentTitle.Text
source: Recent searches
zh_hans: 最近搜索

# SearchPanelEmptyText.Text
source: No results
zh_hans: 无搜索结果

# ChatInputBox.PlaceholderText
source: Send a message to the agent... (Enter to send, Ctrl+Enter for newline)
zh_hans: 向 Agent 发送消息... (Enter 发送，Ctrl+Enter 换行)

# SendButton.AutomationProperties.Name
source: Send
zh_hans: 发送

# StartAgentSelector.PlaceholderText
source: Select the agent for this new session
zh_hans: 选择新会话要使用的 Agent

# StartAgentSelector.AutomationProperties.Name
source: New session agent selector
zh_hans: 新会话 Agent 选择

# CancelButton.AutomationProperties.Name
source: Cancel
zh_hans: 取消发送

# ChatModeSelector.PlaceholderText
source: Choose mode
zh_hans: 选择模式

# ChatAcpProfileSelector.PlaceholderText
source: Select ACP profile
zh_hans: 选择 ACP 配置文件

# MarryHerButton.Content
source: Marry her
zh_hans: 娶她

# MarryHerButton.ToolTipService.ToolTip
source: Placeholder for the “Marry her” feature
zh_hans: “娶她”功能占位

# ProjectNavNewSessionItem.Text
source: New session
zh_hans: 新建会话

# SessionNavArchiveItem.Text
source: Archive...
zh_hans: 归档…

# SessionNavMoveItem.Text
source: Move...
zh_hans: 移动…

# SessionNavRenameItem.Text
source: Rename...
zh_hans: 重命名…

# SessionProjectPickerDialog.PrimaryButtonText
source: Move
zh_hans: 移动

# SessionProjectPickerDialog.CloseButtonText
source: Cancel
zh_hans: 取消

# SessionProjectPickerDialogSessionLabel.Text
source: Session
zh_hans: 会话

# SessionProjectPickerDialogInstructionText.Text
source: Select a target project to move this session to.
zh_hans: 选择要移动到的项目

source: Project list
zh_hans: 项目列表

# DiffPanelPlaceholder.Text
source: Diff panel placeholder
zh_hans: Diff 面板占位

# PlanEmptyTitle.Text
source: No plan yet
zh_hans: 暂无计划

# PlanEmptySubtitle.Text
source: Waiting for agent updates
zh_hans: 等待 Agent 更新

# BottomPanelButton.ToolTipService.ToolTip
source: Bottom Panel
zh_hans: 底栏

# BottomPanelButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Bottom Panel
zh_hans: 底栏

# DiffPanelButton.ToolTipService.ToolTip
source: Diff
zh_hans: 差异

# DiffPanelButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Diff Panel
zh_hans: 差异面板

# TodoPanelButton.ToolTipService.ToolTip
source: Todo
zh_hans: 待办

# TitleBarAuxiliaryPanelUnavailable.ToolTip
source: Unavailable at the current window size
zh_hans: 当前窗口尺寸下不可用

# TodoPanelButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Todo Panel
zh_hans: 待办面板

# BottomPanelPlaceholder.Text
source: Bottom panel placeholder
zh_hans: 底栏占位

# BottomPanelTerminalTab.Text
source: Terminal
zh_hans: 终端

# BottomPanelOutputTab.Text
source: Output
zh_hans: 输出

# SettingsBreadcrumbRoot
source: Settings
zh_hans: 设置

# TitleBarBackButton.ToolTipService.ToolTip
source: Back
zh_hans: 返回

# TitleBarBackButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Back
zh_hans: 返回

source: Toggle sidebar
zh_hans: 切换侧边栏

# TitleBarToggleLeftNavButtonCollapse.ToolTip
source: Collapse sidebar
zh_hans: 收起侧边栏

# TitleBarToggleLeftNavButtonExpand.ToolTip
source: Expand sidebar
zh_hans: 展开侧边栏

# TitleBarMiniWindowButton.ToolTipService.ToolTip
source: Open mini window
zh_hans: 打开迷你窗口

source: Open mini window
zh_hans: 打开迷你窗口

# NavAddProjectLabel.Text
source: Add project
zh_hans: 添加项目

# SessionsDialog.CloseButtonText
source: Close
zh_hans: 关闭

# SessionsDialogSearchBox.PlaceholderText
source: Search sessions
zh_hans: 搜索会话

source: Search sessions
zh_hans: 搜索会话

# SessionsDialogDefaultTitle
source: Sessions
zh_hans: 会话

# ConfigurationEditorDialog.Title
source: Edit configuration
zh_hans: 编辑配置

# ConfigurationEditorDialog.PrimaryButtonText
source: Save
zh_hans: 保存

# ConfigurationEditorDialog.SecondaryButtonText
source: Cancel
zh_hans: 取消

# ConfigurationEditorDialogName.Header
source: Name
zh_hans: 名称

# ConfigurationEditorDialogName.PlaceholderText
source: For example: Local Agent / Remote Test Environment
zh_hans: 例如：本地 Agent / 远程测试环境

# ConfigurationEditorDialogTransport.Header
source: Transport
zh_hans: 传输协议

# ConfigurationEditorDialogCommand.Header
source: Command
zh_hans: 执行命令

# ConfigurationEditorDialogCommand.PlaceholderText
source: For example: python / node / agent.exe
zh_hans: 例如：python / node / agent.exe

# ConfigurationEditorDialogArgs.Header
source: Arguments
zh_hans: 参数

# ConfigurationEditorDialogArgs.PlaceholderText
source: For example: ssh -T user@host /opt/acp/bin/agent stdio
zh_hans: 例如：ssh -T user@host /opt/acp/bin/agent stdio

# ConfigurationEditorDialogServerUrl.Header
source: Server URL
zh_hans: 服务器地址

# ConfigurationEditorDialogServerUrl.PlaceholderText
source: wss://example.com or http://localhost:8080/sse
zh_hans: wss://example.com 或 http://localhost:8080/sse

# ConfigurationEditorDialogHint.Text
source: Saved changes will automatically flow back to the configuration card.
zh_hans: 保存后会自动与“配置”卡片联动。

# MiniChatSessionSelector.PlaceholderText
source: Select session
zh_hans: 选择会话

# MiniChatReturnButton.ToolTipService.ToolTip
source: Return to main window
zh_hans: 返回主窗口

source: Return to main window
zh_hans: 返回主窗口

# MiniChatInputBox.PlaceholderText
source: Type a message
zh_hans: 输入消息

# MiniChatSendButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Send
zh_hans: 发送

# ChatViewAskUserTitle.Text
source: Agent needs your input
zh_hans: Agent 需要你的输入

# ChatViewAskUserSubmitButton.Content
source: Submit answers
zh_hans: 提交答案

source: Session loading
zh_hans: 会话加载中

# DataStorage_ClearCacheDialog.Title
source: Clear cache
zh_hans: 清理缓存

# DataStorage_ClearCacheDialog.Content
source: This deletes all files in the local cache folder.
zh_hans: 将删除本地缓存目录下的所有文件。

# DataStorage_ClearCacheDialog.PrimaryButtonText
source: Clear
zh_hans: 清理

# DataStorage_ClearCacheDialog.SecondaryButtonText
source: Cancel
zh_hans: 取消

# DataStorage_ResetPreferencesDialog.Title
source: Restore defaults
zh_hans: 恢复默认设置

# DataStorage_ResetPreferencesDialog.Content
source: This restores General, Appearance, Data & Storage, Shortcuts, and related settings to their defaults.
zh_hans: 将恢复常规、外观、数据与存储、快捷键等设置到默认值。

# DataStorage_ResetPreferencesDialog.PrimaryButtonText
source: Restore
zh_hans: 恢复

# DataStorage_ResetPreferencesDialog.SecondaryButtonText
source: Cancel
zh_hans: 取消

# DataStorage_ClearAllLocalDataDialog.Title
source: Clear all local data
zh_hans: 清空所有本地数据

# DataStorage_ClearAllLocalDataDialog.Content
source: This deletes all local data, including configuration, logs, cache, and exports. This action cannot be undone.
zh_hans: 这将删除所有本地数据（配置、日志、缓存、导出等）。该操作不可撤销。

# DataStorage_ClearAllLocalDataDialog.PrimaryButtonText
source: Clear
zh_hans: 清空

# DataStorage_ClearAllLocalDataDialog.SecondaryButtonText
source: Cancel
zh_hans: 取消

# UiInteractionInfoDialogTitle
source: Notice
zh_hans: 提示

# UiInteractionConfirmButtonText
source: OK
zh_hans: 确定

# UiInteractionCancelButtonText
source: Cancel
zh_hans: 取消

# UiInteractionPickFolderTitle
source: Add project
zh_hans: 添加项目

# AgentProfileEditorPageTitleNew
source: New
zh_hans: 新建

# AgentProfileEditorPageTitleEdit
source: Edit
zh_hans: 编辑

# AgentProfileEditorName.Header
source: Name
zh_hans: 名称

# AgentProfileEditorName.PlaceholderText
source: For example: Local Agent / Remote Test Environment
zh_hans: 例如：本地 Agent / 远程测试环境

# AgentProfileEditorTransport.Header
source: Transport
zh_hans: 传输协议

# AgentProfileEditorCommand.Header
source: Command
zh_hans: 执行命令

# AgentProfileEditorCommand.PlaceholderText
source: For example: python / node / agent.exe
zh_hans: 例如：python / node / agent.exe

# AgentProfileEditorArgs.Header
source: Arguments
zh_hans: 参数

# AgentProfileEditorArgs.PlaceholderText
source: For example: ssh -T user@host /opt/acp/bin/agent stdio
zh_hans: 例如：ssh -T user@host /opt/acp/bin/agent stdio

# AgentProfileEditorServerUrl.Header
source: Server URL
zh_hans: 服务器地址

# AgentProfileEditorServerUrl.PlaceholderText
source: wss://example.com or http://localhost:8080/sse
zh_hans: wss://example.com 或 http://localhost:8080/sse

# AgentProfileEditorAdvancedTitle.Text
source: Advanced options
zh_hans: 高级选项

# AgentProfileEditorAuthTitle.Text
source: Authentication
zh_hans: 认证

# AgentProfileEditorToken.Header
source: Token (optional)
zh_hans: Token（可选）

# AgentProfileEditorApiKey.Header
source: API key (optional)
zh_hans: API Key（可选）

# AgentProfileEditorProxyTitle.Text
source: Proxy
zh_hans: 代理

# AgentProfileEditorProxyEnabled.Header
source: Enable proxy
zh_hans: 启用代理

# AgentProfileEditorProxyUrl.Header
source: Proxy URL
zh_hans: 代理 URL

# AgentProfileEditorConnectionTitle.Text
source: Connection
zh_hans: 连接

# AgentProfileEditorTimeout.Header
source: Connection timeout (seconds)
zh_hans: 连接超时（秒）

# AgentProfileEditorCancelButton.Content
source: Cancel
zh_hans: 取消

# AgentProfileEditorSaveButton.Content
source: Save
zh_hans: 保存

# DiscoverSessionsTitle.Text
source: Discover sessions
zh_hans: 发现会话

# DiscoverSessionsSubtitle.Text
source: Select a node to browse available sessions
zh_hans: 选择一个节点来浏览会话

# DiscoverSessionsNoSelectionTitle.Text
source: No node selected
zh_hans: 未选择节点

# DiscoverSessionsNoSelectionDescription.Text
source: Select an agent node on the left to browse importable sessions.
zh_hans: 请在左侧选择一个 Agent 节点以浏览其可导入的会话

# DiscoverSessionsImportableListLabel.Text
source: Importable sessions
zh_hans: 可导入的会话列表

# DiscoverSessionsRefreshText.Text
source: Refresh list
zh_hans: 刷新列表

# DiscoverSessionsBackButton.ToolTipService.ToolTip
source: Back to profiles
zh_hans: 返回节点列表

source: Back to profiles
zh_hans: 返回节点列表

# DiscoverSessionsConnectionError.Title
source: Service connection issue
zh_hans: 服务连接异常

# DiscoverSessionsEmptyTitle.Text
source: No importable sessions for this node
zh_hans: 当前节点没有可导入的会话

# DiscoverSessionsEmptyDescription.Text
source: Try refreshing later, or verify that this agent can list historical sessions.
zh_hans: 可以稍后刷新列表，或确认该 Agent 是否支持列出历史会话。

# DiscoverSessionsImportButton.Content
source: Import session
zh_hans: 导入会话

# Acp_HydrationCompletionTitle.Text
source: Session Load Completion Policy
zh_hans: 会话加载完成策略

# Acp_HydrationCompletionHint.Text
source: Choose when a remote session should be considered fully loaded.
zh_hans: 用于控制远程会话在何时被判定为“加载完成”。

# Acp_HydrationMode_StrictReplay.Name
source: Strict Replay
zh_hans: 严格回放

# Acp_HydrationMode_StrictReplay.Description
source: Consider loading complete only after replay projection reaches a stable state.
zh_hans: 仅在回放投影达到稳定状态后，才将会话视为加载完成。

# Acp_HydrationMode_LoadResponse.Name
source: Fast Complete
zh_hans: 快速完成

# Acp_HydrationMode_LoadResponse.Description
source: Consider loading complete when session/load returns; replay continues asynchronously.
zh_hans: 在 session/load 返回后即判定加载完成，回放在后台继续进行。

# ToolCallPillPayloadTitle
source: Payload details
zh_hans: 调用参数详情

# ToolCallPillKindRead
source: Read file
zh_hans: 读取文件

# ToolCallPillKindEdit
source: Edit file
zh_hans: 编辑文件

# ToolCallPillKindDelete
source: Delete file
zh_hans: 删除文件

# ToolCallPillKindMove
source: Move file
zh_hans: 移动文件

# ToolCallPillKindSearch
source: Search code
zh_hans: 搜索代码

# ToolCallPillKindExecute
source: Run command
zh_hans: 执行命令

# ToolCallPillKindSwitchMode
source: Switch mode
zh_hans: 切换模式

# ToolCallPillKindThink
source: Thinking
zh_hans: 思考中

# ToolCallPillKindFetch
source: Fetch data
zh_hans: 获取数据

# ToolCallPillKindDefault
source: Tool call
zh_hans: 工具调用

# ToolCallPillSummaryPathLabel
source: Path
zh_hans: 路径

# ToolCallPillSummaryQueryLabel
source: Query
zh_hans: 查询

# ToolCallPillSummaryCommandLabel
source: Command
zh_hans: 命令
